InformationRegisters/ИпотечныйСтатусКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИпотечныйСтатусКлиента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИпотечныхЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИпотечныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИпотечныхЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыИпотечныхЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыИпотечныхЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Консультирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоданаЗаявкаНаКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобрениеБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитВыдан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИпотекаСервер/Ext/Module.bsl
Процедура ОбновитьСтатусВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Первичный = Истина, ДатаПодачи = Неопределено, РешениеБанка = Неопределено, Выдан = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Запрос) Тогда
		Если Выдан Тогда
			СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.КредитВыдан);
		Иначе
			Если Первичный Тогда
				СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.Консультирование); //2.1
			Иначе
				Если ДатаПодачи = Неопределено И РешениеБанка = Неопределено Тогда
					СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.СборДокументов); //2.2
				ИначеЕсли ЗначениеЗаполнено(ДатаПодачи) И РешениеБанка = Неопределено Тогда
					СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.ПоданаЗаявкаНаКредит); //2.3
				ИначеЕсли ЗначениеЗаполнено(ДатаПодачи) И РешениеБанка = Справочники.РешенияБанков.ОдобрениеБанка Тогда
					СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.ОдобрениеБанка); //2.4
				ИначеЕсли ЗначениеЗаполнено(ДатаПодачи) И РешениеБанка = Справочники.РешенияБанков.ОтказБанка Тогда
					СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.Отказ); //2.5
				ИначеЕсли ЗначениеЗаполнено(ДатаПодачи) И РешениеБанка = Справочники.РешенияБанков.ОтказКлиентаОтРассмотрения Тогда
					СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Перечисления.СтатусыИпотечныхЗаявок.Отказ); //2.5
				Иначе
					//ошибка
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаписиВРегистреИпотечныйСтатусКлиента(Регистратор, Запрос, Статус)
	
	НЗ = РегистрыСведений.ИпотечныйСтатусКлиента.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	НЗ.Прочитать();
	
	Если НЗ.Количество() <> 0 Тогда
		Для Каждого Запись Из НЗ Цикл
			Если Запись.Запрос = Запрос И Запись.Статус = Статус Тогда
				Возврат;
			Иначе
				//НЗ.Очистить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.Запрос = Запрос;
	НоваяЗапись.Регистратор = Регистратор;
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.ИпотечныйСтатус = ПолучитьАктуальныйСтатус(Статус, Регистратор.Дата, Запрос);
	
	НЗ.Записать();
	
КонецПроцедуры

Функция ПолучитьАктуальныйСтатус(ТекущийСтатусДокумента, ДатаСреза, Запрос)
	
	ИндексТекущегоСтатуса = Перечисления.СтатусыИпотечныхЗаявок.Индекс(ТекущийСтатусДокумента);
	
	Отбор = Новый Структура("Запрос", Запрос);
	
	НЗ = РегистрыСведений.ИпотечныйСтатусКлиента.СрезПоследних(ТекущаяДата(), Отбор);
	
	Если НЗ.Количество() = 0 Тогда
		Возврат ТекущийСтатусДокумента;
	Иначе
		ПоследнийСтатус = НЗ[0].ИпотечныйСтатус;
		Если ЗначениеЗаполнено(ПоследнийСтатус) Тогда
			ИндексПоследнегоСтатуса = Перечисления.СтатусыИпотечныхЗаявок.Индекс(ПоследнийСтатус);
		Иначе
			Возврат ТекущийСтатусДокумента;
		КонецЕсли;
		
		Если ИндексПоследнегоСтатуса = 0 Тогда
			Возврат ТекущийСтатусДокумента;
		ИначеЕсли (ИндексПоследнегоСтатуса = 1 Или ИндексПоследнегоСтатуса = 2 Или ИндексПоследнегоСтатуса = 3 Или ИндексПоследнегоСтатуса = 5) И ИндексПоследнегоСтатуса > ИндексТекущегоСтатуса Тогда
			Возврат ПоследнийСтатус;
		ИначеЕсли ИндексПоследнегоСтатуса = 3 И ИндексТекущегоСтатуса = 4 Тогда
			Возврат ИндексПоследнегоСтатуса;
		ИначеЕсли ИндексПоследнегоСтатуса = 4 И ИндексПоследнегоСтатуса > ИндексТекущегоСтатуса Тогда
			Возврат ТекущийСтатусДокумента;
		Иначе
			Возврат ТекущийСтатусДокумента;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
